<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"bfa7e3f45bf7f48d659ce03ebfa458c498f536a17cd0867258b06ee0e40e980d","plan_job_ref":"Job Staging Image Build & Push #4 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7343115322","plan_hash":"8f7e9cf30abbd5d04faa01007b0a128fc4a0665a9291ad9920725822aabb411b","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be created
+   resource "aws_ecs_service" "fastapi-service" {
+       cluster                            = "arn:aws:ecs:eu-central-1:806066816337:cluster/fastapi-cluster"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       force_new_deployment               = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "dev-fastapi-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = {
+           "Environment" = "Dev Environment"
        }
+       task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:7"
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       load_balancer {
+           container_name   = "dev_FastAPI_image"
+           container_port   = 5000
+           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group/7c49f2922395a2e5"
        }

+       network_configuration {
+           assign_public_ip = true
+           security_groups  = (known after apply)
+           subnets          = (sensitive value)
        }
    }

  # aws_security_group.ALB_to_containers will be created
+   resource "aws_security_group" "ALB_to_containers" {
+       arn                    = (known after apply)
+       description            = "Allowing traffic from ALB to containers for dev FastAPI environment"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = []
+               description      = "Inbound ALB to ECS containers"
+               from_port        = 5000
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = [
+                   "sg-09895e6a8deaf278b",
                ]
+               self             = false
+               to_port          = 5000
            },
        ]
+       name                   = "alb-to-containers"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       vpc_id                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Image Build & Push #4](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7343115322)
<details open><summary>Outputs</summary>

```hcl
ecr_registry_id     = "806066816337"
ecr_repository_name = "dev/irezd/fastapi"
```
</details>